
// Основано на Custom Role Generator (https://github.com/rarus/custom-role-generator)
// Copyright (c) 1С-Рарус, лицензия CC BY-SA 4.0

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Параметры.ТекущийТекстОграничения) Тогда
		ТекстОграниченияДоступа = Параметры.ТекущийТекстОграничения;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Завершить(Команда)

	Если ПустаяСтрока(ТекстОграниченияДоступа) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Введите текст условия ограничения доступа.'"));
		Возврат;
	КонецЕсли;

	Закрыть(ТекстОграниченияДоступа);

КонецПроцедуры

#КонецОбласти
