#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура СгенерироватьРасширение(Команда)

	МассивАктуальныхРолей = ПолучитьАктуальныеРолиНаСервере();

	Если МассивАктуальныхРолей.Количество() = 0 Тогда
		Ждать ПредупреждениеАсинх(НСтр("ru = 'Нет ролей со статусом ""Актуальна"".'"));
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("МассивРолей", МассивАктуальныхРолей);
	ОткрытьФорму("Обработка.цур_ГенераторРолей.Форма.Форма", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьАктуальныеРолиНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Роли.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.цур_Роли КАК Роли
	|ГДЕ
	|	Роли.Статус = &Статус
	|	И НЕ Роли.ЭтоГруппа";
	Запрос.УстановитьПараметр("Статус", Перечисления.цур_СтатусыРоли.Актуальна);

	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

#КонецОбласти
