#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Заполняет новый элемент справочника значениями из предопределённого элемента ПоУмолчанию.
// Применяется только при создании нового элемента через интерфейс.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - стандартный параметр платформы
//  ТекстЗаполнения      - Строка       - стандартный параметр платформы
//  СтандартнаяОбработка - Булево       - стандартный параметр платформы
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если Ссылка = Справочники.цур_ИнформационныеБазы.ПоУмолчанию Тогда
		Возврат;
	КонецЕсли;

	Шаблон = Справочники.цур_ИнформационныеБазы.ПоУмолчанию;

	Если ЗначениеЗаполнено(Шаблон) Тогда

		Реквизиты = цур_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Шаблон,
			"ПутьКПлатформе, ИспользоватьБСП, ИспользоватьПромежуточнуюБазу,
			|ИсточникМетаданных, ИсточникРолей, КаталогВыгрузкиКонфигурации");

		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Реквизиты);

	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ИсточникМетаданных) Тогда
		ИсточникМетаданных = Перечисления.цур_ИсточникиМетаданных.ТекущаяКонфигурация;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ИсточникРолей) Тогда
		ИсточникРолей = Перечисления.цур_РежимыЗагрузкиРолей.ВыгрузитьАвтоматически;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
